
#ifndef YRGB2020_MESSAGES_H
#define YRGB2020_MESSAGES_H

// cp1251
static const char msg_intro1[] =   "В давние-давние времена между   миром тьмы и миром живых людей  была построена она - линия защи-ты, ловушка для темных сил.     Сеть. Но князь ужаса скопил силыи готовится нанести удар по че- ловечеству. От ударов порожденийтьмы по Сети уже разбегаются    мелкие трещины. Если защита рух-нет, нашему миру придет конец.  Единственная надежда человечес- тва - залатать дыры в Сети, по- чинить обрывы и восстановить    упавшие участки до того, как    рухнет вся Сеть. Но кто справи- тся  с этой задачей? Ты? Тогда утебя есть всего 5 попыток на то,чтобы добраться до поврежденных участков и выполнить задания." EOL;

static const char msg_mission1[] = "Эй, новенький! Чего сидишь?     Выезжай на адрес: Зеленая, 66,  кв. 6! Клиент жалуется на ско-  рость, соцсети не грузятся, про-верь, что там!" EOL;
static const char msg_mission2[] = "Новенький, для тебя задание! Жи-тель коттеджного поселка жалуе- тся, что у него с утра половина сайтов не открывается! Съезди,  посмотри, что там." EOL;
static const char msg_mission3[] = "Новое задание! В ООО \"Рога и    копыта\" Интернет на работает.   Бухгалтер в ярости, не успевает отправить отчеты, будь осторо-  жен!" EOL;
static const char msg_mission4[] = "Задание4" EOL;
static const char msg_mission5[] = "Задание5" EOL;
static const char msg_mission6[] = "Задание6" EOL;
static const char msg_mission7[] = "Задание7" EOL;
static const char msg_mission8[] = "Задание8" EOL;

static const char msg_quest1[] =   "Вопрос1 \x0d \x0d 1: Правильный вариант \x0d 2: Неправильный вариант \x0d 3: Неправильный вариант" EOL;
static const char msg_quest2[] =   "Вопрос2                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;
static const char msg_quest3[] =   "Вопрос3                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;
static const char msg_quest4[] =   "Вопрос4                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;
static const char msg_quest5[] =   "Вопрос5                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;
static const char msg_quest6[] =   "Вопрос6                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;
static const char msg_quest7[] =   "Вопрос7                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;
static const char msg_quest8[] =   "Вопрос8                         1: Правильный вариант           2: Неправильный вариант         3: Неправильный вариант" EOL;

static const char msg_mis_fail1[] =     "Ответственность и огромная важ- ность задачи легла на твои пле- чи слишком тяжелым грузом и ты  не справился с управлением вело-сипедом. Но битва за Сеть еще   продолжается. Ты готов поднятьсяи продолжить твой путь, чтобы   остановить силы тьмы?" EOL;
static const char msg_mis_task1[] =     "Ты успешно добрался до места!   Выслушав рассказ клиента и про- верив подключение ты перезагру- жаешь маршрутизатор. Проблема   почти решена, тебе осталось     только решить маленькую задачку." EOL;
static const char msg_task_fail1[] =    "Хорошая попытка! Но лучше бы ты ответил правильно. У тебя" EOL;
static const char msg_task_fail2[] =    "оста- лось четыре попытки." EOL;
static const char msg_task_fail3[] =    "оста- лось еще три попытки." EOL;
static const char msg_task_fail4[] =    "оста- лось еще две попытки." EOL;
static const char msg_task_fail5[] =    "оста- лась последняя попытка." EOL;
static const char msg_task_fail6[] =    "Попробуешь еще раз?" EOL;
static const char msg_task_success1[] = "Гигабайты информации текут в на-ших жилах, разгоняя проца! Этот участок Сети восстановлен, силы тьмы не пройдут! Отличная рабо- та! Но битва еще не окончена." EOL;
static const char msg_success1[] =      "Ты это сделал! Не жалея рук и   ног, подключив километры кабелейи перезагрузив сотни маршрутиза-торов ты победил! Сверкающая    Сеть раскинулась над миром, за- щищая его от ужаса и мрака.  Мирне забудет своего героя! И даже начальство хвалит тебя и обещаетповысить зарплату. Скоро, через месяц или два, когда-нибудь..." EOL;
static const char msg_fail1[] =         "Ты пытался. Но попытки кончи-   лись. Кримпер дрожит в усталых руках. Ноги устали крутить педали. Клиенты ругают тебя, пока ты из последних сил проверяешь, подключен ли кабель питания. Разве может обычный человек все это вынести? В этой битве невозможно победить. Ты сдаешься. Стоя на улице ты запрокидываешь голову и смотришь в небо. Звезды начинают исчезать по одной. Тьма наступает." EOL;
static const char msg_press_fire[] =    "Нажми \"Fire\"..." EOL;

#endif //YRGB2020_MESSAGES_H