
#ifndef YRGB2020_MESSAGES_H
#define YRGB2020_MESSAGES_H

// cp1251                          |                                |
static const char msg_intro1[] =   "В давние-давние времена между   "
                                   "миром тьмы и миром живых людей  "
                                   "была построена она - линия защи-"
                                   "ты, ловушка для темных сил.\n"
                                   "\n"
                                   "Сеть.\n"
                                   "\n"
                                   "Но от ударов порождений тьмы по "
                                   "Сети уже разбегаются трещины.   "
                                   "Если защита рухнет, миру придет "
                                   "конец. Единственная надежда -   "
                                   "починить обрывы и восстановить  "
                                   "упавшие участки до того, как    "
                                   "рухнет вся Сеть.\n"
                                   "Но кто справится с этой задачей?"
                                   "\n"
                                   "Ты?\n"
                                   "\n"
                                   "Тогда у тебя есть всего пять по-"
                                   "пыток на то, чтобы добраться до "
                                   "поврежденных участков и выпол-  "
                                   "нить задания." EOL;

static const char msg_fail1[] =    "Ты пытался. Но попытки кончи-   "
                                   "лись.\n"
                                   "\n"
                                   "Кримпер дрожит в усталых руках. "
                                   "Ноги устали крутить педали. Кли-"
                                   "енты ругают тебя. Разве может   "
                                   "обычный человек все это вынести?"
                                   "\n"
                                   "В этой битве невозможно побе-   "
                                   "дить. Ты сдаешься. Стоя на улице"
                                   "ты запрокидываешь голову и смо- "
                                   "тришь в небо. Звезды начинают   "
                                   "исчезать по одной.\n"
                                   "\n"
                                   "Тьма наступает." EOL;

//                                      |                                |
static const char msg_mis_fail1[] =     "Ответственность и огромная важ- "
                                        "ность задачи легла на твои пле- "
                                        "чи слишком тяжелым грузом и ты  "
                                        "не справился с управлением вело-"
                                        "сипедом. Но битва за Сеть еще   "
                                        "продолжается." EOL;

static const char msg_mis_fail2[] =     "Ты готов подняться и продолжить "
                                        "твой путь, чтобы остановить силы"
                                        "тьмы?" EOL;

static const char msg_mis_task1[] =     "Ты успешно добрался до места!   "
                                        "Выслушав рассказ клиента и про- "
                                        "верив подключение, ты перезагру-"
                                        "жаешь маршрутизатор.\n"
                                        "\n"
                                        "Проблема почти решена, тебе ос- "
                                        "талось только решить маленькую  "
                                        "задачку." EOL;

static const char msg_task_fail1[] =    "Хорошая попытка! Но лучше бы ты "
                                        "ответил правильно." EOL;
static const char msg_task_fail2[] =    "У тебя осталось четыре попытки." EOL;
static const char msg_task_fail3[] =    "У тебя осталось еще три попытки." EOL;
static const char msg_task_fail4[] =    "У тебя осталось еще две попытки." EOL;
static const char msg_task_fail5[] =    "У тебя последняя попытка." EOL;
static const char msg_task_fail6[] =    "Попробуешь еще раз?" EOL;

//                                      |                                |
static const char msg_task_success1[] = "Гигабайты информации текут в на-"
                                        "ших жилах, разгоняя проца! Этот "
                                        "участок Сети восстановлен, силы "
                                        "тьмы не пройдут!\n"
                                        "Отличная работа!\n"
                                        "\n"
                                        "Но битва еще не окончена." EOL;

//                                      |                                |
static const char msg_success1[] =      "Ты это сделал! Не жалея рук и   "
                                        "ног, подключив километры кабелей"
                                        "и перезагрузив сотни маршрутиза-"
                                        "торов ты победил!\n"
                                        "\n"
                                        "Сверкающая Сеть раскинулась над "
                                        "миром, защищая его от ужаса и   "
                                        "мрака.  Мир не забудет своего   "
                                        "героя! И даже начальство хвалит "
                                        "тебя и обещаетповысить зарплату."
                                        "Скоро, через месяц или два, ког-"
                                        "да-нибудь..." EOL;

static const char msg_mission1[] = "Эй, новенький!\n"
                                   "Чего сидишь? Выезжай на адрес:  "
                                   "Зеленая, 66, кв. 6!\n"
                                   "Клиент жалуется на скорость,    "
                                   "соцсети не грузятся, проверь,   "
                                   "что там!\n"
                                   "Избегай луж на дороге!" EOL;

static const char msg_mission2[] = "Новенький, для тебя задание!    "
                                   "Житель коттеджного поселка жалу-"
                                   "ется, что у него с утра половина"
                                   "сайтов не открывается! Съезди,  "
                                   "посмотри, что там." EOL;

static const char msg_mission3[] = "Новенький, у нас заявка, возмож-"
                                   "но обрыв линии, по коням!" EOL;

static const char msg_mission4[] = "Новое задание!\n"
                                   "В ООО \"Рога и копыта\" Интернет  "
                                   "не работает. Бухгалтер в ярости,"
                                   "не успевает отправить отчеты,   "
                                   "будь осторожен!" EOL;

//                                 |                                |
static const char msg_mission5[] = "Время приключений настало!\n"
                                   "В зловещем замке на окраине го- "
                                   "рода нет Интернета! Возможно,   "
                                   "летучие мыши перегрызли оптово- "
                                   "локно." EOL;

static const char msg_mission6[] = "Новый вызов!\n"
                                   "В школе N6 под угрозой срыва    "
                                   "урок информатики. Возможно, уче-"
                                   "ники перегрызли оптоволокно." EOL;

static const char msg_mission7[] = "Не время отдыхать!\n"
                                   "Звонили, сам-знаешь-откуда, не  "
                                   "могут запустить видеоконференцию"
                                   "с сам-зна-ешь-кем!\n"
                                   "Срочно отправляйся туда!" EOL;

static const char msg_mission8[] = "Задание специально для тебя!    "
                                   "У девушки не открывается тиндер,"
                                   "возможно, понадобится переуста- "
                                   "новить windows. На всякий случай"
                                   "возьми с собой пиццу или развод-"
                                   "ной ключ" EOL;

#define RIGHT_ANSWER1 ONE
static const char msg_quest1[] =   "Что из следующего лучше всего   "
                                   "описывает Интернет?\n"
                                   "\n"
                                   "1. Ловушка для темных сил\n"
                                   "2. Компьютерная сеть\n"
                                   "3. Черная коробочка с лампочкой" EOL;

#define RIGHT_ANSWER2 ONE
static const char msg_quest2[] =   "Когда была запущена первая Cеть\n"
                                   "\n"
                                   "1. В давние-давние времена\n"
                                   "2. В 1983 году\n"
                                   "3. В 1996 году" EOL;

#define RIGHT_ANSWER3 TWO
static const char msg_quest3[] =   "Кто пишет правила для Сети?\n"
                                   "\n"
                                   "1. Никто\n"
                                   "2. Сами знаете кто\n"
                                   "3. Твоя мамка" EOL;

#define RIGHT_ANSWER4 TWO
static const char msg_quest4[] =   "Зачем люди пользуются\n"
                                   "Интернетом?\n"
                                   "\n"
                                   "1. За шкафом\n"
                                   "2. Это Интернет пользуется людь-"
                                   "   ми\n"
                                   "3. Ради лайков и репостов" EOL;

#define RIGHT_ANSWER5 TWO
static const char msg_quest5[] =   "Как правильно называется "
                                   "электромонтажный ручной инстру- "
                                   "мент?\n"
                                   "\n"
                                   "1. Скриммер в ночи\n"
                                   "2. Кримпер тьмы\n"
                                   "3. Криплер ног" EOL;

#define RIGHT_ANSWER6 THREE
static const char msg_quest6[] =   "Зачем используется капча?\n"
                                   "\n"
                                   "1. Чтобы боксеру не выбили зубы\n"
                                   "2. Чтобы пересчитать все пожар- "
                                   "   ные гидранты в Калифорнии\n"
                                   "3. Как преграда для порождений  "
                                   "   тьмы" EOL;

#define RIGHT_ANSWER7 ONE
static const char msg_quest7[] =   "Что такое рунет?\n"
                                   "\n"
                                   "1. Русскоязычный отряд защиты   "
                                   "   Сети\n"
                                   "2. Сладкое блюдо из Скайрима\n"
                                   "3. Древняя система письма, ис-  "
                                   "   пользуется гномами" EOL;

#define RIGHT_ANSWER8 TWO
static const char msg_quest8[] =   "Какой IP адрес используется ком-"
                                   "пьютером чтобы послать сообщение"
                                   "самому себе?\n"
                                   "\n"
                                   "1. 6.6.6.6\n"
                                   "2. 127.0.0.1\n"
                                   "3. П.М.М.Л." EOL;

static const char msg_press_fire[] =    "Нажми Fire или 5..." EOL;

#endif //YRGB2020_MESSAGES_H